/**
 *Вывести на экран результат вычисления 1+2−4.
 */

/**
 * @author mindybaev
 *
 */
public class Задача_6 {

	/**
	 * @param args
	 */
	public static void main(String[] args)
	{
		int x=1+2-4;
		System.out.println(x);
	}

}
