/**
 * Вывести на экран числа 100, 96, 92, ... до последнего положительного включительно
 */

/**
 * @author mindybaev
 *
 */
public class Задача_81 {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		System.out.println("Вывести на экран числа 100, 96, 92, ... до последнего положительного включительно");
		for(int i = 100;i>=0;i--){
			System.out.print(i+" ");
		}
	}

}
